### Jupyter Notebook
#### Edit Mode[enter]
- shift + enter
- ctrl + enter
- alt + enter

#### Command Mode[esc]
- [ a ]: 위에 새로운 cell 추가
- [ b ]: 아래에 새로운 cell 추가
- [ c ]: cell 복사
- [ v ]: cell 아래에 붙여 넣기
- [ x ]: cell 잘라내기
- [ dd ]: cell 삭제

#### 커맨드 모드에서 [m] : markdown
#### 커맨드 모드에서 [y] : cell
<hr>

### Pandas

In [1]:
import pandas as pd

In [6]:
df1 = pd.DataFrame([['사과', 1800, 24], ['딸기', 1500, 38], ['수박', 3000, 13]],
columns = ['제품', '가격', '판매량'],
index = [0, 1, 2])
df1

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [17]:
df1.index

Int64Index([0, 1, 2], dtype='int64')

In [19]:
df1.columns

Index(['제품', '가격', '판매량'], dtype='object')

In [20]:
df1.values

array([['사과', 1800, 24],
       ['딸기', 1500, 38],
       ['수박', 3000, 13]], dtype=object)

In [21]:
#컬럼 추출
df1['가격']

0    1800
1    1500
2    3000
Name: 가격, dtype: int64

In [22]:
#가격 컬럼의 합
sum(df1['가격'])
#df1['가격'].sum()

6300

In [23]:
#가격 컬럼의 평균
df1['가격'].mean()
#df1['가격'].sum()/df1['가격'].count()

2100.0

In [24]:
#dataFrame으로 컬럼 추출
df1[['가격']]

     가격
0  1800
1  1500
2  3000

In [13]:
df2 = df1.drop(['제품'], axis=1)
df2

     가격  판매량
0  1800   24
1  1500   38
2  3000   13

In [25]:
#외부경로 데이터 활용 & index를 id로 지정
df_exam = pd.read_excel('../../Doit_Python-main/Data/excel_exam.xlsx').set_index('id')
df_exam.head()

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        1    45       86       78
4        1    30       98       58
5        2    25       80       65

In [26]:
df_exam_csv = pd.read_csv('../../Doit_Python-main/Data/exam.csv')
df_exam_csv.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [38]:
over_exam = df_exam_csv[['math', 'english', 'science']] > 50
over_exam.sum()

math       10
english    20
science    13
dtype: int64